# 1장

## 1.1 웹 개발의 역사

### 1. 자바스크립트의 탄생

- 웹의 다양한 콘텐츠를 표현하지 위해 이미지, 플러그인 요소를 쉽게 조합할수 있는 새로운 언어의 필요성

### 2. 자바스크립트 표준, ECMAScript의 탄생

- 크로스브라우징이슈, 자바스크립트와 브라우저 발전속도의 차이로 표준화된 자바스크립트의 필요성이 제기됨.
- 폴리필 : 브라우저가 지원하지 않는 코드를 브라우저에서 사용할 수 있도록 변환한 코드 조각이나 플러그인
- 트랜스파일 : 최신 버전의 코드를 예전 버전의 코드로 변환

⇒ 최신 기능을 구버전의 실행환경에서 동작할수 있게 변환해줌

### 3. 웹사이트에서 웹 애플리케이션으로의 전환

- 웹사이트 : 정적인 웹. 단반향으로 정보 제공. 사용자와 상호작용하지 않음. 콘텐츠가 동적으로 업데이트되지 않음.
- 웹 애플리케이션 : 사용자와 상호작용하는 쌍방향 소통의 웹.

⇒ 개발 규모의 확대로 개발 생태계의 변화

### 4. 개발 생태계의 발전

- 컴포넌트 베이스 개발 : 재사용할 수 있는 컴포넌트를 개발 또는 조합해서 하나의 애플리케이션을 만드는 개발방법론.
    - 서비스에서 다루는 데이터를 구분하고 그에 맞는 UI를 표현할 수 있게 컴포넌트 단위로 개발
    - 하나의 독립된 기능을 재사용하기 위한 코드묶음 + 런타임 환경에서 독립적으로 배포, 실행될 수 있는 단위
    - 한 컴포넌트는 다른 컴포넌트와의 의존성을 최소화하거나 없애야함.

### 5. 개발자 협업의 필요성 증가

- 대규모 프로덕트 개발 이후 효과적인 유지보수를 위한 협업 보완책이 필요하게 됨.

## 1.2 자바스크립트의 한계

### 1. 동적 타입 언어

- 변수에 타입을 명시적으로 지정하지 않아도 코드가 실행됨.
- 런타임에 변수값이 할당될 때 해당 값의 타입에 따라 변수 타입이 결정됨.

### 2. 동적 타이핑 시스템의 한계

### 3. 한계 극복을 위한 해결방안

- 자바스크립트 인터페이스의 필요성
- JSDoc : 모듈, 네임스페이스, 클래스, 메서드, 매개변수등에 대한 API문서 생성 도구. 주석의 성격을 지녀 강제성을 부여해 사용하기 어려움
- propTypes : 리액트에서 컴포넌트 props의 타입을 검사하기 위해 사용하는 속성.
- 다트 : 구글에서 제시한 새로운 언어. 타이핑이 가능하나 자바스크립트가 주도하는 상황에 개발의 파편화를 불러올 수 있음.

### 4. 타입스크립트의 등장

- 마이크로소프트에서 제시한 언어. 자바스크립트 코드를 그대로 사용할 수 있음.
- 슈퍼셋 : 기존 언어에 새로운 기능과 문법을 추가해서 보완하거나 향상하는것. 기존 언어와 호환. 컴파일러등으로 기존 언어 코드로 변환하여 실행
- 안정성 보장 : 정적 타이핑 제공. 컴파일 단계에서 타입 검사. 런타임 에러를 사전에 방지할 수 있음
- 개발 생산성 향상 : IDE에서 타입 자동완성기능 제공. 변수와 함수 타입 추론 가능.
- 협업에 유리 : 인터페이스, 제네릭 지원으로 기술된 인터페이스로 코드를 쉽게 파악할 수 있음.
- 자바스크립트에 점진적으로 적용 가능

# 2장

## 2.1 타입

### 1. 자료형으로서의 타입

- 자료형 : 여러 종류의 데이터를 식별하는 분류체계. 컴파일러에 값의 형태를 알려줌.
- 타입을 사용해서 값의 종류를 명시할 수 있고 메모리를 효율적으로 사용할 수 있음.

### 2. 집합으로서의 타입

- 값이 가질수 있는 유효한 범위의 집합
- 타입 시스템은 코드에서 사용되는 유효한 값의 범위를 제한하여 런타임에서 발생할 수 있는 유효하지 않은 값에 대한 에러를 방지함.

### 3. 정적 타입과 동적 타입

- 정적타입 : 컴파일시 변수의 타입 결정. 코드 수준에서 타입 명시 필요. C, 자바, 타입스크립트
- 동적타입 : 런타임시 변수 타입 결정. 코드수준에서 타입 정의 필요 없음. 자바스크립트, 파이썬

### 4. 강타입과 약타입

- 강타입 : 서로 다른 타입을 갖는 값끼리 연산하면 컴파일러 또는 인터프리터에서 에러 발생
- 약타입 : 서로 다른 타입을 갖는 값끼리 연산할 때 컴파일러 또는 인터프리터가 내부적으로 판단해서 특정 값의 타입을 변환하여 연산을 수행하고 값을 도출함.
- 약타입 언어에서는 암묵적 변환이 발생하며 개발자가 명시적으로 변환하지 않아도 연산을 할 수 있는 편리함을 제공하지만 의도와 다르게 동작할 수 있음.
- 타입을 사용해 프로그램이 유효한 작업을 하지 않도록 방지할 필요가 있음

### 5. 컴파일 방식

- 컴파일 : 사람이 이해할 수 있는 고수준 언어로 작성된 코드를 컴퓨터가 해석할 수 있는 바이너리 언어로 변환하는것.
- 타입스크립트의 컴파일 결과물은 자바스크립트 파일임 : 자바스크립트의 컴파일 타임에 런타임 에러를 사전에 잡아내기 위해서

## 2.2 타입스크립트의 타입 시스템

### 1. 타입 애너테이션 방식

- 타입 애너테이션 : 반환값에 타입을 병시적으로 선언해서 어떤 타입 값이 저장될 것인지 컴파일러에 직접 알려주는 문법
- 타입스크립트에서 타입 명시 방식

```jsx
 // 변수이름 : type구문 
 let isDone : boolean = false;
```

### 2. 구조적 타이핑

- 구조적 타이핑 : 객체가 가지고있는 속성을 바탕으로 타입을 구분하는것. 이름이 다른 객체라도 속성이 동일하다면 호환이 가능한 동일 타입으로 여김.

```jsx
interface Pet {
	name : string;
}

interface Cat {
	name : string;
	age : number;
}

let pet : Pet;
let cate : Cat = { name : "zag", age : 2 };

pet = cat
```

- 타입스크립트에서는 특정 값이 다른 타입을 동시에 가질 수 있음.

### 3. 구조적 서브타이핑

- 타입의 상속을 구조적 타이핑을 기반으로 하는 것.

```jsx
class Person {
	name: string;
	age: number;
	
	constructor(name: string, age: number) {
		this.name = name;
		this.age = age;
	}
}

class Developer {
	name: string;
	age: number;
	sleepTime: number;
	
	constructor(name: string, age: number, sleepTime: number) {
		this.name = name;
		this.age = age;
		this.sleepTime= sleepTime;
	}
}

function greet(p: Person) {
	console.log(`Hello, I'm ${p.name}`);
}

const developer = new Developer("zig", 20, 7);

greet(developer);
```

- developer 클래스가 Person 클래스를 상속받이 않더라도 greet(developer)는 정상동작
- 서로 다른 두 타입간의 호환성이 타입 내부 구조에 의해결정. 타입이 계층구조로부터 자유로움.

### 4. 자바스크립트를 닮은 타입스크립트

- 명목적 타이핑 : 구조적으로 동일하지만 서로 다른 클래스로 생성한 인스턴스가 호환되지 않음. 안정적임
- 타입스크립트가 구조적타이핑을 선택한 이유 : 자바스크립트가 덕타이핑을 기반으로 하기 때문
- 덕 타이핑 : 매개변숫값이 올바르게 주어진다면 그 값이 어떻게 만들어졌는지 신경쓰지 않고 사용한다는 개념.
- 구조적타이핑은 정적타이핑, 덕타이핑은 동적 타이핑에서 사용함. 타입스크립트가 자바스크립트의 특성을 참고햇다는 것임.

### 5. 구조적 타이핑의 결과

- 예기치 못한 결과가 나올 수 있음

```jsx
interface Cube {
	width: number;
	height: number;
	depth: number;
}

function addLines(c: Cube){
	let total = 0;
	//error
	for (const axis of Object.keys(c)) {
		const length = c[axis];
	}
}
```

- c에 들어올 객체는 Cube의 속성 외에도 어떤 속성이든 가질 수 있기 때문에 c[axis]의 타입이 string일수도 있어 에러 발생

### 6. 점진적 타입 확인

- 점진적 타입 검사 : 컴파일 타임에 타입을 검사하면서 타입 선언 생략을 허용하는 방식.
- 타입을 지정한 변수와 표현식은 정적으로 타입을 검사. 타입을 생략한 경우 동적으로 검사. 타입 선언을 생략하는 경우 암시적 타입 변환이 일어남.
- 타입이 올바르게 정해지지 않으면 런타임시 에러 발생하기도 함

### 7. 자바스크립트 슈퍼셋으로서의 타입스크립트

- 모든 자바스크립코드는 타입스크립트 코드지만, 모든 타입스크립트 코드가 자바스크립트인 것은 아님.
- 타입스크립트는 타입을 명시하는 문법을 가지고있음

### 8. 값 vs 타입

- 값 : 프로그램이 처리하기 위해 메모리에 저장하는 모든 데이터
    - 문자열 숫자 변수 매개변수 객체 함수
- 타입
    - type이나 interface로 커스텀 타입 정의 가능
    
    ```jsx
    type Person = {
    	name: string;
    }
    
    const Person = {
    	isWorking: true;
    }
    ```
    
    - 값 공간과 타입 공간은 서로 충돌하지 않음 : 타입스크립트 문법인 type으로 선언한 내용은 자바스크립트 런타임에서 제거되기 떄문.
    - 떄문에 함수의 매개변수처럼 여러 개의 심볼이 함꼐 쓰이는 경우 타입과 값을 명확하게 구분해야함
    
    ```jsx
    function email(options: { person: Person; subject: string; body: string }) {}
    //error
    
    function email({ 
    	person, 
    	subject, 
    	body,
    }: {
    	person: Person; 
    	subject: string; 
    	body: string ;
    
    }) {}
    ```
    
    - 타입스크립트에서 구조분해할당시 오류가 발생할 수 있으므로 값과 타입을 구분해서 작성해야함.
    - 값과 타입 공간에 동시에 존재하는 심볼이므로 주의 필요 : class, enum

# 질문

- 덕타이핑과 구조적 타이핑의 공통점과 차이점
- 강타입과 약타입 언어의 특징을 설명하고 이를 바탕으로 약타입언어인 자바스크립트를 타입스크립트가 어떻게 보완할수 있는지 설명하세요
